import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';

@Component({
  selector: 'app-faq',
  standalone: true,
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.css'],
  imports: [CommonModule]
})
export class FaqComponent {
  faqs = [
    {
      question: 'ما هو المنتور للأعمال وما الخدمات التي تقدمها؟',
      answer: 'المنتور للأعمال تقدم خدمات تعليمية عالية الجودة من خلال نموذج اشتراك، مما يتيح الوصول إلى أكبر مكتبة للتعلم الإلكتروني باللغة العربية في العالم. تشمل الخدمات منصة مخصصة بالكامل، مسارات تعليمية مخصصة، أدوات تقارير متقدمة، ونظام إدارة تعلم آلي (LMS). يتم إصدار شهادات مشتركة بين المنتور والشركة بعد إتمام الدورات.',
      open: false
    },
    {
      question: 'ما طرق الدفع المتاحة للاشتراكات؟',
      answer: 'يمكن الدفع عبر الإنترنت باستخدام التحويل البنكي أو بطاقات الائتمان.',
      open: false
    },
    {
      question: 'هل تعتبر أسعار المنتور للأعمال مرتفعة؟',
      answer: 'لا، المنتور للأعمال تقدم أسعارًا تنافسية لمكتبتها الواسعة من الدورات. التكلفة أقل من العديد من المنصات الأخرى وتوفر قيمة كبيرة، خاصة لمحتوى اللغة العربية.',
      open: false
    },
    {
      question: 'ما الفوائد التي ستحصل عليها شركتنا عند الاشتراك في المنتور للأعمال؟',
      answer: 'تشمل الفوائد محتوى تعليمي مخصص، برامج تقييم للفرق، وحلول تدريب مخصصة تتماشى مع أهداف الشركة.',
      open: false
    },
    {
      question: 'ما القطاعات التي تخدمها المنتور للأعمال؟',
      answer: 'تخدم المنتور للأعمال جميع القطاعات، حيث توفر حلول تدريب مخصصة لتلبية احتياجات كل صناعة.',
      open: false
    },
    {
      question: 'هل سيحصل المتعلمون على شهادة عند إتمام الدورات؟',
      answer: 'نعم، يحصل المتعلمون على شهادات إلكترونية يمكن أن تشمل شعار شركتكم، وهي متاحة للتنزيل والطباعة.',
      open: false
    },
    {
      question: 'هل ستكون شراكة شركتنا مع المنتور واضحة للموظفين؟',
      answer: 'نعم، سيتم عرض شعار شركتكم على البوابة، ويمكن إضافة ما يصل إلى شعارين إضافيين على شهادات إتمام الدورات.',
      open: false
    },
    {
      question: 'كم عدد البرامج التدريبية التي تقدمها المنتور للأعمال؟',
      answer: 'تقدم المنتور للأعمال مئات الدورات التدريبية التي تغطي مجالات مثل الموارد البشرية، ريادة الأعمال، الأعمال، الإعلام الرقمي، وغيرها.',
      open: false
    },
    {
      question: 'كيف يمكن لمدير التعلم والتطوير تقييم تقدم المتدربين؟',
      answer: 'يمكن تتبع التقدم من خلال تقارير مفصلة (تقييم، تقدم، وحالة) وتحديد جداول زمنية للموظفين أو المجموعات.',
      open: false
    },
  ];
  
  toggleFaq(index: number) {
    this.faqs[index].open = !this.faqs[index].open;
  }
}